@rem =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=
@rem 変数の定義
@rem =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=
@SET OALD8_SOUNDS=sound-uk_tag.txt sound-us_tag.txt
@SET OALD8_RESOURCES=sound-uk sound-us


@rem =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=
@rem 生成したファイルの削除
@rem =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=

@echo cleaning ...
del /F /Q %OALD8_SOUNDS% >NUL 2>&1
rmdir /S /Q %OALD8_RESOURCES% >NUL 2>&1
@echo done.

pause
